Repository: lawrancej/logisim
Catalog: xlate/ru/doc/omegat-logisim-doc_ru-omegat.tmx
Source language: en
Languages: ru_ru

source: About...
ru_ru: О программе...

source: If the pins in the subcircuit's layout have labels associated with them, then Logisim will display that label in a tip (that is, a temporary text box) when the user hovers the mouse over the corresponding location of the subcircuit component.
ru_ru: Если контакты на чертеже подсхемы имеют метки, связанные с ними, то Logisim будет показывать эти метки в подсказке (то есть во временном текстовом поле), когда пользователь наведёт мышь на соответствующее место компонента подсхемы.

source: // that.
ru_ru: // этому.

source: The Layout tab
ru_ru: Вкладка Чертёж

source: Indicates whether the wire is horizontal or vertical.
ru_ru: Указывает, является провод горизонтальным или вертикальным.

source: The bit width of the component's inputs and outputs.
ru_ru: Разрядность входов и выходов компонента.

source: Text Tool Behavior
ru_ru: Поведение Инструмента Текст

source: If it is a three-state pin, then the corresponding bit will rotate between the three states.
ru_ru: Если это контакт с тремя состояниями, то соответствующий бит будет переключаться между тремя состояниями.

source: Select input: Determines which of the bit groups should be routed to the output.
ru_ru: Выбирающий вход: определяет, какая из групп битов должна быть направлена на выход.

source: Our final step is to test our circuit to ensure that it really does what we intended.
ru_ru: Наш последний шаг - проверить нашу схему, чтобы удостовериться, что она действительно делает то, что мы хотели.

source: North edge, third from left (input, bit width 1)
ru_ru: Северный край, третий слева (вход, разрядность равна 1)

source: Appearance:
ru_ru: Внешний вид:

source: Clear - when 1, the buffer is emptied and does not accept further characters.
ru_ru: Очистка - когда значение равно 1, буфер очищается и больше не принимает символов.

source: The attribute table
ru_ru: Таблица атрибутов

source: (The anchor and the ports are exceptions — they are always on top.)
ru_ru: (Якорь и порты являются исключениями - они всегда наверху.)

source: You can click on an input pin and start typing to give it a label.
ru_ru: Вы можете нажать на входном контакте и начать ввод, чтобы назначить ему метку.

source: On the left side is an explorer where you can choose the tool you want to map.
ru_ru: С левой стороны - проводник, где вы можете выбрать инструмент, который необходимо привязать.

source: The component is designed so that it can be cascaded with other subtractors to provide subtract more bits than is possible with a single subtractor: The borrow-in input provides a one-bit value to be borrowed out of the difference (if the borrow-in input is specified), and a borrow-out output indicates whether the component needs to borrow an upper-order bit to complete the subtraction without underflow (assuming unsigned subtraction).
ru_ru: Компонент разработан таким образом, что его можно включать каскадно с другими вычитателями чтобы обеспечить вычитание с большим количеством битов, чем возможно с одним вычитателем: вход займа предоставляет однобитное значение, которое должно быть занято из разности (если вход займа определён), а выход займа определяет, что компонент должен занять старший бит чтобы завершить вычитание без потери значимости (подразумевается беззнаковое вычитание).

source: If the value is Rising Edge, then when the clock input changes from 0 to 1, the leftmost character is consumed (when enabled by the Read Enable input).
ru_ru: Если значение - Передний фронт, то когда значение тактового входа изменяется с 0 на 1, то левый символ считывается (если разрешено входом Разрешение чтения).

source: The number of split ends.
ru_ru: Количество разделённых концов.

source: // (You might be tempted to determine the counter's current value
ru_ru: // (Вы, возможно, подумываете о том, чтобы определить текущее состояние счётчика

source: Sends circuit(s) to a printer.
ru_ru: Посылает схему (или несколько) на принтер.

source: Note that I'm stopping short of saying that Logisim always addresses gate delays well.
ru_ru: Не могу позволить себе сказать, что Logisim всегда правильно обращается с задержками элементов.

source: It will display the values it has at the time it gives up.
ru_ru: Он будет показывать значения, которые были, когда он сдался.

source: The below screen shot demonstrates what things look like after selecting the upper input of our XOR circuit and scrolling down to view the Label Font attribute.
ru_ru: Снимок экрана ниже показывает, как это выглядит после выделения верхнего входа нашей схемы Исключающее ИЛИ и пролистывания вниз до атрибута Шрифт метки.

source: JFontChooser, from Christos Bohoris
ru_ru: JFontChooser, от Христоса Богориса

source: (Hereinafter, translation is included without limitation in the term "modification".) Each licensee is addressed as "you".
ru_ru: (Здесь и далее перевод включается без ограничений в понятие "модификация".) Каждый обладатель лицензии адресуется как "вы".

source: Sun's JavaHelp project
ru_ru: Проект Sun JavaHelp

source: Allows you to select how often ticks occur.
ru_ru: Позволяет вам выбирать, как часто происходят такты.

source: Next: Creating expressions.
ru_ru: Далее: Создание выражений.

source: First radix when wire poked: Configures how values are displayed when a wire is clicked using the Poke Tool.
ru_ru: Первое основание при взаимодействии с проводом: настраивает, как отображаются значения, когда на проводе щёлкнули Инструментом Нажатие.

source: Closes all currently open projects and terminates Logisim.
ru_ru: Закрывает все открытые проекты и завершает Logisim.

source: If, however, the user is viewing the state of a subcircuit as described in the `Debugging Subcircuits' of the User's Guide, then the pin's value is pinned to whatever value the subcircuit is receiving from the containing circuit.
ru_ru: Однако, если пользователь просматривает состояние подсхемы, как описано в разделе "Отладка подсхемы Руководства пользователя, то значение на контакте жёстко привязано к значению, которое подсхема принимает из содержащей её схемы.

source: The code in this example JAR library is released under the MIT license, a more permissive license than the GPL, under which the rest of Logisim is released.
ru_ru: Код в этом примере JAR библиотеки выпущен под лицензией MIT, более либеральной лицензией, чем GPL, под которой выпущена остальная часть Logisim.

source: Removes the currently selected components from the circuit onto Logisim's clipboard.
ru_ru: Удаляет выбранные компоненты из схемы в буфер Logisim.

source: Especially do this if you are an educational institution; the information will help me in gaining support for the work.
ru_ru: Тем более сделайте это, если вы - учебное заведение; эта информация поможет мне в получении поддержки для работы.

source: The location of the control line, imagining we are facing the output from the input: If the component faces east and is right-handed, the control line is to the south; but if it is left-handed, the control line is to the north.
ru_ru: Расположение управляющего входа, если представить, что мы смотрим со стороны входа на выход: если компонент направлен на восток и значение атрибута - По правую руку, то управляющий вход на юге; а если По левую руку, то на севере.

source: Logisim will not attempt to detect sequential circuits: If you tell it to analyze a sequential circuit, it will still create a truth table and corresponding Boolean expressions, although these will not accurately summarize the circuit behavior.
ru_ru: Logisim не будет пытаться выявить последовательностную схему: если вы скажете ему проанализировать последовательностную схему, он по-прежнему создаст таблицу истинности и соответствующие логические выражения, хотя они не будут точно отражать поведение схемы.

source: The component's output, which will match the source input if indicated by the gate input, or will be floating if the gate input is the negation of what indicates negation.
ru_ru: Выход компонента, значение на котором будет совпадать со значением на входе исток, если это определено входом затвор, или будет плавающим, если на входе затвор соответствующее значение.

source: (On MacOS, this menu item is under the Logisim menu.)
ru_ru: (На MacOS этот пункт меню находится в меню Logisim.)

source: An orange wire is effectively "broken": It does not carry values between components.
ru_ru: Оранжевый провод фактически "сломан": он не передаёт значения между компонентами.

source: // printer output), then skip this.
ru_ru: // вида для печати), то пропустить это.

source: Selects which of the values in memory is currently being accessed by the circuit.
ru_ru: Выбирает, к какому значению в памяти схема в данный момент получает доступ.

source: For example, 11001011 logically shifted right twice is 00110010.
ru_ru: Например, 11001011 логически сдвинутое вправо на два - это 00110010.

source: (Three dashes "---" indicate a separator, which is drawn as a gray line.) Between the explorer and the list are five buttons and a combo box:
ru_ru: (Три тире "---" обозначают разделитель, который отрисовывается как серая линия.) Между проводником и списком - пять кнопок и выпадающий список:

source: Many people have made generous contributions to the wide range of software distributed through that system in reliance on consistent application of that system; it is up to the author/donor to decide if he or she is willing to distribute software through any other system and a licensee cannot impose that choice.
ru_ru: Многие люди благодаря этой системе внесли щедрый вклад в широкий спектр распространяемого ПО полагаясь на согласованное применение этой системы; автору принадлежит право решать хочет ли он или она распространять ПО в этой системе или в какой-то другой, и получатель лицензии не может влиять на принятие этого решения.

source: The following substitutions will be made into the text.
ru_ru: Следующие замены будут внесены в текст.

source: More sophisticated components built into Logisim tend to have larger delays, but these delays are somewhat arbitrary and may not reflect reality.
ru_ru: Более сложные компоненты, встроенные в Logisim, как правило имеют большие задержки, но эти задержки несколько произвольны и могут не отражать реальность.

source: Memory library
ru_ru: Библиотека Память

source: Note that if the carry-in input is completely floating, then it will be assumed to be all-zeroes.
ru_ru: Обратите внимание, что если значение на входе переноса полностью плавающее, то будет подразумеваться, что оно полностью состоит из нулей.

source: (Controlled inverter only) Determines whether to draw a larger or a smaller version of the component.
ru_ru: (Только для управляемого инвертора) Определяет следует отрисовывать большую или меньшую версию компонента.

source: Incidentally, the ordering of the inputs in the truth table will match their top-down ordering in the original circuit, with ties being broken in left-right order.
ru_ru: Кстати, порядок входов в таблице истинности будет соответствовать их следованию сверху вниз в оригинальной схеме, и никак не связан с порядком их следования слева направо.

source: In our overall testing circuit, we include both the subcircuit from adder-master.circ and the subcircuit from the solution circuit located directly into the nested circuit.
ru_ru: Во всю нашу проверяющую схему мы включаем и подсхему из adder-master.circ, и подсхему из схемы с решением.

source: This method is invoked
ru_ru: Этот метод вызывается

source: N-type
ru_ru: n-тип

source: Negator
ru_ru: Отрицатель

source: In particular, the component includes an enable input and an enable output.
ru_ru: В частности, компонент включает в себя разрешающий вход и разрешающий выход.

source: Menu Tool
ru_ru: Инструмент Меню

source: Logisim allows you to modify this behavior, relieving you of the need to go to the toolbar and/or the explorer all the time.
ru_ru: Logisim позволяет вам изменить это поведение, избавляя вас от необходимости постоянно обращаться к панели инструментов или проводника.

source: Select Combinational Analysis, and the current Combinational Analysis window will appear.
ru_ru: Выберите Комбинационный анализ, и появится текущее окно Комбинационного анализа.

source: // compute the next value
ru_ru: // вычислить следующее значение

source: Logisim splitters cannot have a bit from the combined end correspond to multiple split ends.
ru_ru: Разветвители в Logisim не могут иметь соответствие бита в объединённом конце нескольким разъединённым концам.

source: The other numbers display values starting from that memory address; the hex editor may display four, eight, or sixteen values per line, depending on what fits in the window.
ru_ru: Другие числа отображают значения, начиная с этого адреса памяти; шестнадцатеричный редактор может отображать 4, 8 или 16 значений в каждой строке, в зависимости от того, что вписывается в окно.

source: Set As Main Circuit
ru_ru: Сделать главной схемой

source: Horizontal Alignment
ru_ru: Горизонтальное выравнивание

source: When clicked, all the options and tool attributes change to the settings in the current template (as selected under the application preferences).
ru_ru: При её нажатии все параметры и атрибуты инструментов заменяются на настройки из текущего шаблона (выбранного в настройках приложения).

source: The Help menu
ru_ru: Меню Справка

source: * (as is typical for Logisim), which happens to be in the center of the
ru_ru: * (это типично для Logisim), расположенного в центре

source: Duplicate
ru_ru: Дублировать

source: In either case, the individual bits of the value being sent or received is displayed within the component (except within printer view, when the component only says how many bits wide the pin is).
ru_ru: В обоих случаях отдельные биты значения, которое оправляется или принимается, отображаются внутри данного компонента (кроме Вида для печати, когда компонент говорит только какова разрядность контакта).

source: This tab includes preferences affecting the behavior of the circuit layout editor.
ru_ru: На этой вкладке находятся настройки, влияющие на поведение редактора чертежа схемы.

source: But by the time you finish it, none of your wires should be blue or gray.
ru_ru: Но когда вы закончите, ни один из ваших проводов не должен быть синего или серого цвета.

source: Clicking a clock component will toggle its current output value immediately.
ru_ru: Нажатие на компонент Тактовый генератор будет немедленно переключать его текущее выходное значение.

source: If p-gate is 0 while n-gate is 1, then the value found at source is transmitted to drain.
ru_ru: Если на p-затворе 0, а на n-затворе 1, то значение с истока передаётся на сток.

source: Undoes the most recently completed action affecting how the circuit would be saved in a file.
ru_ru: Отменяет самое последнее завершённое действие, влияющее на то, как схема будет сохранена в файле.

source: The clock input is ignored when Read Enable is 0.
ru_ru: Тактовый вход игнорируется, когда значение входа Разрешение чтения - 0.

source: (The top two ones are lost.)
ru_ru: (Две верхние единицы потеряны.)

source: Store: This input is present only if "separate load and store ports" is selected for the Data Interface attribute.
ru_ru: Запись: этот вход представлен, только если "Раздельные порты чтения и записи" выбрано для атрибута Интерфейс данных.

source: The icon for the Pin tool is drawn as a circle or a square depending on the value of its "Output?" attribute.
ru_ru: Значок инструмента Контакт отрисовывается как круг или квадрат в зависимости от значения его атрибута "Выход?".

source: p-gate
ru_ru: p-затвор

source: When this is other than 0, a pixel that is lit remains lit for the given number of clock ticks after the component's inputs indicate that the pixel should become dim.
ru_ru: Когда это значение отлично от нуля, горящий пиксель продолжает светиться заданное число тактов после того, как входы компонента начинают указывать, что пиксель должен стать потушенным.

source: The output value will match the input values on the west edge whose number is the same as the value currently received through the select input on the south.
ru_ru: Выходное значение будет соответствовать входному значению на западном крае, номер которого равен значению, принятому в данный момент на выбирающем входе на юге.

source: Pastes the components on Logisim's clipboard into the current selection.
ru_ru: Вставляет компоненты из буфера Logisim в текущее выделение.

source: Next: Pop-up menus and files.
ru_ru: Далее: Всплывающие меню и файлы.

source: Next: Splitters.
ru_ru: Далее: Разветвители.

source: // "corrupt" the value found there.
ru_ru: // "испортит" значение, содержащееся там.

source: This includes automatically drawing the circle at a T intersection as above, indicating that the wires are connected.
ru_ru: Сюда относится и автоматическое рисование кружка на Т-образном соединении выше, указывающего, что провода соединены.

source: For maximum portability to future versions, you should stick as much as possible to the classes in the ...instance, ...data, and ...tools packages.
ru_ru: Для максимальной переносимости на будущие версии вам следует насколько возможно придерживаться использования классов в пакетах ...instance, ...data, и ...tools.

source: The divisor (that is, the second operand for the division)
ru_ru: Делитель (то есть второй операнд деления)

source: to distribute corresponding source code.
ru_ru: распространить соответствующий исходный код.

source: Tunnel
ru_ru: Тоннель

source: Starts automatically ticking the clock.
ru_ru: Запускает автоматическое прохождение тактов для тактовых генераторов.

source: (If there were several pins on the box's north or south side, they would correspond to the same left-right order in the subcircuit.)
ru_ru: (Если бы было несколько контактов на северной или южной стороне коробки, то их порядок соответствовал бы порядку слева направо в подсхеме.)

source: But if the user doesn't drag the mouse far enough to initiate a wire before releasing the button, the press is treated as a mouse click, and so the wire is simply added into the current selection.
ru_ru: Но если пользователь не перетащит мышь достаточно далеко, чтобы создать провод, перед тем, как отпустит кнопку, то нажатие рассматривается как простое нажатие мыши, так что провод просто добавится к текущему выделению.

source: any
ru_ru: любое

source: Available only when editing a circuit's appearance and an existing vertex has been selected on a polyline or polygon, this menu item removes the selected vertex.
ru_ru: Этот пункт меню доступен только при редактировании внешнего вида схемы и при условии, что выделена вершина на ломанной или на многоугольнике. Он удаляет выделенную вершину.

source: For multi-bit values, you can configure exactly how the value is displayed (in binary, decimal, or hexadecimal, for example) using the Layout pane of the Logisim Preferences dialog box.
ru_ru: Для многобитных значений вы можете настроить, как отображается значение (в двоичном, десятичном или шестнадцатеричном виде, например), используя вкладку Чертёж диалогового окна Настройки Logisim.

source: When diagrammed, the source input and drain output are drawn connected by a plate; Logisim draws an arrowhead to indicate the direction of flow from input to output.
ru_ru: На схемах вход исток и выход сток изображаются соединёнными пластиной; Logisim отрисовывает стрелку, указывающую направление потока от входа к выходу.

source: Every tool for adding components to a circuit also has a set of attributes, which are imparted to the components created by the tool, although the components' attributes may be changed later without affecting the tool's attributes.
ru_ru: Каждый инструмент для добавления компонентов в схему также имеет набор атрибутов, которые передаются компоненту, созданному с помощью этого инструмента, хотя атрибуты компонента могут быть изменены позднее, не затрагивая атрибуты инструмента.

source: To change it, use the Select... button.
ru_ru: Чтобы изменить его, используйте кнопку Выбрать... .

source: The Table tab displays the current log graphically.
ru_ru: Вкладка Таблица отображает текущий журнал графически.

source: Gate delays
ru_ru: Задержки логических элементов

source: The built-in libraries (other than Base) were written using the same API as JAR libraries can use, so they aptly demonstrate the range of functionality that the JAR libraries can support.
ru_ru: Встроенные библиотеки (кроме библиотеки Базовые) были написаны с использованием того же API, что могут использовать библиотеки JAR, так что они удачно демонстрируют набор функциональных возможностей, которые JAR библиотеки могут поддерживать.

source: The Delete and Backspace keys will delete everything in the selection from the circuit.
ru_ru: Клавиши Delete и Backspace удаляют со схемы всё выделение.

source: * any time any of the inputs change their values; it may also be invoked in
ru_ru: * каждый раз, когда значение на любом из входов меняется; он также может быть вызван при

source: Create an arbitrary polygon, whose vertices are indicated by a succession of clicks.
ru_ru: Создать произвольный многоугольник, вершины которого указываются последовательностью щелчков.

source: This negation is performed by maintaining all the lower-order bits up to the lowest-order 1, and complementing all bits above that.
ru_ru: Это отрицание осуществляется перебором всех младших битов до самой младшей 1 и отрицанием всех битов старше этого.

source: drain
ru_ru: сток

source: Wiring: Components that interact directly with wires.
ru_ru: Проводка: компоненты, которые взаимодействуют непосредственно с проводами.

source: Bit x
ru_ru: Бит x

source: And the low level value indicates that it should update continuously when the clock input is 0.
ru_ru: И значение Низкий уровень означает, что он должен обновляться непрерывно, пока на тактовом входе 0.

source: You should also place an output pin next to the OR gate's output using the Output tool ().
ru_ru: Вам также нужно разместить выходной контакт рядом с выходом элемента ИЛИ, используя инструмент Добавить выходной контакт ().

source: Bit Extender
ru_ru: Расширитель битов

source: Step 3: Adding text
ru_ru: Шаг 3: Добавление текста

source: But the effect is observable when we use the AND gate's output as an input into the clock of a D flip-flop.
ru_ru: Но этот эффект можно наблюдать, если мы подадим выход элемента И на тактовый вход D триггера.

source: This option removes the necessity of dealing with the Controlled Buffer and so it is easier to use.
ru_ru: Этот вариант устраняет необходимость Управляемого буфера, так что он проще в использовании.

source: When the knob is at rest (in the center), the value has the bit pattern 10...00.
ru_ru: Когда рукоять отпущена (находится в центре), значение имеет шаблон битов 10...00.

source: As an example of the level of sophistication of Logisim's algorithm, consider the following circuit.
ru_ru: В качестве примера уровня проработанности алгоритма Logisim рассмотрим следующую схему.

source: (One difference is that any header lines will give the full path to components lying in subcircuits.) The format is intentionally simple so that you can feed it into another program for processing, such as a Python/Perl script or a spreadsheet program.
ru_ru: (Одним из отличий является то, что любая строка заголовка будет содержать полный путь к компонентам, находящимся в подсхемах.) Формат специально сделан таким простым, чтобы вы могли передать файл в другую программу для обработки, например в скрипт на Python/Perl или в электронную таблицу.

source: East edge, upper pin (output, bit width matches Select Bits attribute)
ru_ru: Восточный край, верхний контакт (выход, разрядность соответствует атрибуту Выбирающие биты)
